#include<iostream>
using namespace std;
int main(void){
int M[3][3]={{1,2,3},{4,5,6},{7,8,9}};
int (*ptr)[3]; int *p; int **pt; //포인터 배열, 포인터, 이중포인터 선언
ptr = M; // 포인터에 배열 주소값 저장
cout << ptr << " " << M <<endl ; // M[0][0]주소값 출력
cout << ptr+1 << " " << M+1 <<endl; // M[1][0]주소값 출력
cout << *(ptr+1) << " " << ptr[1] << " " << *(M+1) << " " << M[1] <<endl ; //M[1][0]주소값 출력
cout << **(ptr+1) << " " << **(M+1) << " " << *M[1] << " " << M[1][0] <<endl; //M[1][0]값 출력
p = M[0];// 포인터에 배열 주소값 저장
cout << p << " " << M[0] << " " << *M << " " <<endl; //M[0][0]주소값 출력
cout << p+1 << " " << M[0]+1 << " " << *M+1 << " " <<endl; //M[0][1]주소값 출력
cout << *(p+1) << " " << *(M[0]+1) << " " << *(*M+1) << " " <<endl; //M[0][1]값 출력
pt = &p; // pt = M; (X)
cout << *pt << " " << p << " " <<endl ; //M[0][0]주소값 출력
cout << **pt << " " << *p << " " <<endl; //M[0][0]값 출력
return 0;
}
